docs: convert flows to mermaid
